# 1st program
print ((9 ** 0.5) * 5) # Возведение числа 9 в степень 0,5 с последующим умножением на число 5
# 2nd program
print (9.99 > 9.98 and 1000 != 1000.1) # Одновременное выполнение двух логических выражений
# 3rd program
print ( 2 * 2 + 2) # Сложение и умножение без приоритета
print ( 2 * (2 + 2)) # Сложение и умножение с приоритетом сложения
print (2 * 2 + 2 == 2 * (2 + 2)) # Сравнение двух выражений
# 4th program
print (float ('123.456')) # Преобразование строки в дробное число
print (float ('123.456') * 10) # Умножение на 10, чтобы сместить 4 в целую часть
print (int(float ('123.456') * 10)) # Преобразование дробного числа в целое число
print (int(float ('123.456') * 10) % 10) # Остаточное деление на 10, чтобы оставить 4
